custom_models/flow_past_sphere/Oldroyd-BLog/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       910;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          30;
        startFace       920;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          500;
        startFace       950;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          500;
        startFace       1450;
    }
    sphere
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20;
        startFace       1950;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       1970;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       1980;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          90;
        startFace       1980;
    }
)

// ************************************************************************* //
