custom_models/flow_past_sphere/Oldroyd-BLog/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type           fixedValue;
        value          uniform ( 0.01 0 0 );
        //decrease U and R for blockmesh
        //target Wi 0.01
        	//radius around 1 cm
        	//compare with icofoam
        	//confirm re is <<1
        	//wi compares rate of strain vs relaxation rate
        	//wi = shear rate*relaxation time (lambda or tau)
        	//revisit flow regimes
        	//see const equations book choose order of reading 
        	// ln[c] = theta ? rheotoool userguide
        	//check course schedule for linear algebra outside of math department 
        	//applied math, comp sci, eng
    }

    outlet
    {
        type            zeroGradient;
    }

    "walls|sphere"
    {
       type            fixedValue;
          value           uniform (0 0 0);
     
    }
    
    front
    {
        type           wedge;
    }
    back
    {
    	type		wedge;
    }
}

// ************************************************************************* //
